#  Вычислить число π c заданной точностью d

# *Пример:* 

# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

# π = 3 + 4/(2*3*4) - 4/(4*5*6) + 4/(6*7*8) - 4/(8*9*10) + 4/(10*11*12) - (4/(12*13*14)

from random import uniform

def get_pi(d, pi):
    i = 2
    a = 4
    p = 3
    while True:
        x = a / (i * (i + 1) * (i + 2))
        p = p + x
        y = pi - p
        if y <= d and y > 0:
            return p
        i += 2
        a = -a


d = 0.001
pi = 3.141592653589793

p = get_pi(d, pi)

print(f'При точности {d}, число Pi = {p}')
 
